function myFunction(el) {
    if(el.id === "b1") {
        let p1 = document.getElementById("p1");
        if(el.innerHTML === "Περισσότερα") {
            p1.innerHTML = "Έχουν αναφερθεί ανησυχίες παγκοσμίως για τους κινδύνους που πιθανόν να έχει. Έχουν αναφερθεί πολλά περιστατικά όπου όσοι έχουν έκαναν το εμβόλιο ανέφεραν θρόμβους στο αίμα τους. Ωστόσο είναι πολύ σπάνια περιστατικά και τα θετικά του εμβολίου ξεπερνούν τα αρνητικά του.";
            el.innerHTML = "Λιγότερα";
        }else {
            p1.innerHTML = "Έχουν αναφερθεί ανησυχίες παγκοσμίως για τους κινδύνους που πιθανόν να έχει...";
            el.innerHTML = "Περισσότερα";
        }
    } else if(el.id === "b2") {
        let p2 = document.getElementById("p2");
        if(el.innerHTML === "Περισσότερα") {
            p2.innerHTML = "Ξεπεράστηκαν οι 1.000.000 δόσεις. Μέχρι στιγμής όσοι έχουν κάνει την πρώτη δόση δεν έχουν αναφέρει τυχόν παρενέργειες, πράγμα το οποίο δίνει το έδαφος για να αυξηθούν οι καθημερινές δοσολογίες.";
            el.innerHTML = "Λιγότερα";
        }else {
            p2.innerHTML = "Ξεπεράστηκαν οι 1.000.000 δόσεις...";
            el.innerHTML = "Περισσότερα";
        }
    } else {
        let p3 = document.getElementById("p3");
        if(el.innerHTML === "Περισσότερα") {
            p3.innerHTML = "Σήμερα ξεκίνησαν οι πρώτοι εμβολιασμοί στην Ελλάδα. Πρώτος που εμβολιάστηκε ήταν ο Πρόεδρος της Ελληνικής Δημοκρατίας και ακολούθησε ο Πρωθυπουργός. Οι συνολικοί εμβολιασμοί που έγιναν σήμερα ήταν 227 και έκαναν το Pfizer.";
            el.innerHTML = "Λιγότερα";
        }else {
            p3.innerHTML = "Σήμερα ξεκίνησαν οι πρώτοι εμβολιασμοί στην Ελλάδα...";
            el.innerHTML = "Περισσότερα";
        }
    }
}